//Напиши скрипт управління формою логіна:
//1.Обробка відправлення форми form.login-form повинна відбуватися
// відповідно до події submit.
//2. Під час відправлення форми сторінка не повинна перезавантажуватися.
//3. Якщо у формі є незаповнені поля, виводь alert з попередженням про те,
// що всі поля повинні бути заповнені.
//4.Якщо користувач заповнив усі поля і відправив форму,
// збери значення полів в об'єкт, де ім'я поля буде ім'ям властивості,
// а значення поля - значенням властивості. Для доступу до елементів форми
// використовуй властивість elements.
//5. Виведи об'єкт із введеними даними в консоль і очисти значення
// полів форми методом reset.

//Пошук елементу за класом login-form:
const form = document.querySelector('.login-form');
//Обробка відправлення форми відповідно до події submit:
form.addEventListener('submit', onFormSubmit);

function onFormSubmit(event) {
  //Під час відправлення форми сторінка не повинна перезавантажуватися:
  event.preventDefault();

  const { elements: { email, password },} = event.currentTarget;

  if (email.value.trim() === '' ||  password.value.trim() === '') {
    // Якщо у формі є незаповнені поля, виводиться alert 
    //з попередженням про те, що всі поля повинні бути заповнені.
    return alert('Please fill in all the fields!');
  } else {
    //Якщо користувач заповнив усі поля і відправив форму,
    // збираються значення полів в об'єкт через властивість elements,
    // де ім'я поля - ім'я властивості, значення поля - значення властивості.
    const formData = new FormData(event.currentTarget);
    formData.email = email.value;
    formData.password = password.value;
    //Виведиться об'єкт із введеними даними в консоль
    console.log(formData);
    //очищення значення полів форми методом reset.
    event.currentTarget.reset();
  } 
}